def transliterate(text):
	# Слоаврь с заменами
	replace_dict = {
		'a': 'а', 'b': 'б', 'v': 'в', 'g': 'г', 'd': 'д',
		'e': 'Є', 'yo': 'ё', 'zh': 'ж', 'z': 'з', 'i': 'и', 'k': 'к',
		'l': 'л', 'm': 'м', 'n': 'н', 'o': 'о', 'p': 'п', 'r': 'р',
		's': 'с', 't': 'т', 'u': 'ю', 'f': 'ф', 'h': 'х', 'c': 'ц',
		'ch': 'ч', 'sh': 'ш', 'sch': 'щ', '—': ' ', 'y': 'Ы', 'ya': 'я',
		'A': 'А', 'B': 'Б', 'V': 'В', 'G': 'Г', 'D': 'Д', 'E': 'Э', 'YO': 'Ё',
		'ZH': 'Ж', 'Z': 'З', 'I': 'И', 'K': 'К', 'L': 'Л', 'M': 'М', 'N': 'Н',
		'O': 'О', 'P': 'П', 'R': 'Р', 'S': 'С', 'T': 'Т', 'U': 'Ю', 'F': 'Ф',
		'H': 'Х', 'C': 'Ц', 'CH': 'Ч', 'SH': 'Ш', 'SCH': 'Щ', 'YA': 'Я', '_': ' '}
	for key in replace_dict:
		text = text.replace(key, replace_dict[key])
	return text